{
  "_name_or_path": "nomic-ai/nomic-embed-text-v1.5",
  "architectures": [
    "NomicBertModel"
  ],
  "attention_probs_dropout_prob": 0.0,
  "classifier_dropout": null,
  "d_model": 768,
  "emb_drop": 0.0,
  "fused_dropout_add_ln": true,
  "hidden_act": "swiglu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 2048,
  "mlp_fc1_bias": false,
  "mlp_fc2_bias": false,
  "model_type": "nomic_bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "rotary",
  "qkv_proj_bias": false,
  "rotary_emb_base": 10000,
  "rotary_emb_fraction": 1.0,
  "rotary_emb_interleaved": false,
  "rotary_emb_scale_base": null,
  "transformers_version": "4.38.0.dev0",
  "type_vocab_size": 2,
  "vocab_size": 30522
}